lua_wrk/result1.txt
Running 30s test @ http://127.0.0.1:8000
  2 threads and 100 connections
  Thread calibration: mean lat.: 4.154ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.879ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.99ms    5.02ms  61.34ms   93.22%
    Req/Sec     1.05k   173.77     2.00k    79.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.77ms
 75.000%    3.52ms
 90.000%    5.81ms
 99.000%   26.01ms
 99.900%   52.16ms
 99.990%   58.05ms
 99.999%   61.38ms
100.000%   61.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.454     0.000000            1         1.00
       1.673     0.100000         3950         1.11
       2.028     0.200000         7902         1.25
       2.301     0.300000        11881         1.43
       2.543     0.400000        15830         1.67
       2.769     0.500000        19766         2.00
       2.887     0.550000        21755         2.22
       3.011     0.600000        23716         2.50
       3.149     0.650000        25689         2.86
       3.313     0.700000        27659         3.33
       3.521     0.750000        29624         4.00
       3.657     0.775000        30616         4.44
       3.825     0.800000        31597         5.00
       4.051     0.825000        32588         5.71
       4.379     0.850000        33579         6.67
       4.875     0.875000        34560         8.00
       5.307     0.887500        35054         8.89
       5.811     0.900000        35547        10.00
       6.599     0.912500        36040        11.43
       7.895     0.925000        36533        13.33
      10.255     0.937500        37031        16.00
      11.623     0.943750        37274        17.78
      13.167     0.950000        37523        20.00
      14.415     0.956250        37771        22.86
      15.511     0.962500        38014        26.67
      16.591     0.968750        38262        32.00
      17.295     0.971875        38385        35.56
      18.111     0.975000        38509        40.00
      19.263     0.978125        38632        45.71
      20.799     0.981250        38755        53.33
      22.255     0.984375        38878        64.00
      22.911     0.985938        38940        71.11
      23.631     0.987500        39002        80.00
      24.911     0.989062        39066        91.43
      26.895     0.990625        39126       106.67
      31.791     0.992188        39187       128.00
      33.119     0.992969        39218       142.22
      35.935     0.993750        39249       160.00
      37.823     0.994531        39280       182.86
      40.031     0.995313        39310       213.33
      42.911     0.996094        39341       256.00
      44.287     0.996484        39357       284.44
      45.823     0.996875        39372       320.00
      47.487     0.997266        39389       365.71
      48.767     0.997656        39403       426.67
      49.567     0.998047        39418       512.00
      49.887     0.998242        39427       568.89
      50.271     0.998437        39434       640.00
      50.975     0.998633        39442       731.43
      51.807     0.998828        39449       853.33
      52.191     0.999023        39457      1024.00
      52.319     0.999121        39461      1137.78
      52.415     0.999219        39465      1280.00
      52.703     0.999316        39469      1462.86
      52.863     0.999414        39472      1706.67
      53.311     0.999512        39476      2048.00
      53.599     0.999561        39478      2275.56
      53.887     0.999609        39480      2560.00
      54.303     0.999658        39482      2925.71
      54.687     0.999707        39484      3413.33
      54.879     0.999756        39486      4096.00
      55.487     0.999780        39487      4551.11
      56.991     0.999805        39488      5120.00
      57.887     0.999829        39489      5851.43
      57.983     0.999854        39490      6826.67
      58.047     0.999878        39491      8192.00
      58.047     0.999890        39491      9102.22
      59.327     0.999902        39492     10240.00
      59.327     0.999915        39492     11702.86
      59.583     0.999927        39493     13653.33
      59.583     0.999939        39493     16384.00
      59.583     0.999945        39493     18204.44
      60.127     0.999951        39494     20480.00
      60.127     0.999957        39494     23405.71
      60.127     0.999963        39494     27306.67
      60.127     0.999969        39494     32768.00
      60.127     0.999973        39494     36408.89
      61.375     0.999976        39495     40960.00
      61.375     1.000000        39495          inf
#[Mean    =        3.986, StdDeviation   =        5.020]
#[Max     =       61.344, Total count    =        39495]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59797 requests in 30.00s, 8.65MB read
Requests/sec:   1993.23
Transfer/sec:    295.23KB