lua_wrk/result2.txt
Running 30s test @ http://127.0.0.1:8000
  8 threads and 100 connections
  Thread calibration: mean lat.: 3400.591ms, rate sampling interval: 12263ms
  Thread calibration: mean lat.: 3421.220ms, rate sampling interval: 12287ms
  Thread calibration: mean lat.: 3415.765ms, rate sampling interval: 12263ms
  Thread calibration: mean lat.: 3434.506ms, rate sampling interval: 12287ms
  Thread calibration: mean lat.: 3416.209ms, rate sampling interval: 12230ms
  Thread calibration: mean lat.: 3423.426ms, rate sampling interval: 12320ms
  Thread calibration: mean lat.: 3440.365ms, rate sampling interval: 12328ms
  Thread calibration: mean lat.: 3425.111ms, rate sampling interval: 12279ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.63s     3.93s   20.56s    57.66%
    Req/Sec   316.12      0.78   317.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.62s 
 75.000%   17.02s 
 90.000%   19.09s 
 99.000%   20.33s 
 99.900%   20.50s 
 99.990%   20.55s 
 99.999%   20.56s 
100.000%   20.58s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6770.687     0.000000            1         1.00
    8183.807     0.100000         5041         1.11
    9527.295     0.200000        10079         1.25
   10936.319     0.300000        15095         1.43
   12296.191     0.400000        20115         1.67
   13623.295     0.500000        25157         2.00
   14311.423     0.550000        27672         2.22
   14958.591     0.600000        30176         2.50
   15638.527     0.650000        32684         2.86
   16343.039     0.700000        35227         3.33
   17022.975     0.750000        37745         4.00
   17383.423     0.775000        38973         4.44
   17727.487     0.800000        40281         5.00
   18055.167     0.825000        41515         5.71
   18415.615     0.850000        42752         6.67
   18743.295     0.875000        44010         8.00
   18923.519     0.887500        44667         8.89
   19087.359     0.900000        45311        10.00
   19267.583     0.912500        45912        11.43
   19447.807     0.925000        46527        13.33
   19628.031     0.937500        47167        16.00
   19709.951     0.943750        47485        17.78
   19791.871     0.950000        47789        20.00
   19873.791     0.956250        48097        22.86
   19955.711     0.962500        48407        26.67
   20037.631     0.968750        48733        32.00
   20070.399     0.971875        48862        35.56
   20119.551     0.975000        49041        40.00
   20168.703     0.978125        49226        45.71
   20201.471     0.981250        49348        53.33
   20250.623     0.984375        49523        64.00
   20267.007     0.985938        49586        71.11
   20299.775     0.987500        49696        80.00
   20316.159     0.989062        49745        91.43
   20348.927     0.990625        49857       106.67
   20365.311     0.992188        49898       128.00
   20381.695     0.992969        49947       142.22
   20398.079     0.993750        50007       160.00
   20398.079     0.994531        50007       182.86
   20414.463     0.995313        50050       213.33
   20430.847     0.996094        50106       256.00
   20430.847     0.996484        50106       284.44
   20447.231     0.996875        50150       320.00
   20447.231     0.997266        50150       365.71
   20463.615     0.997656        50184       426.67
   20463.615     0.998047        50184       512.00
   20479.999     0.998242        50212       568.89
   20479.999     0.998437        50212       640.00
   20479.999     0.998633        50212       731.43
   20496.383     0.998828        50237       853.33
   20496.383     0.999023        50237      1024.00
   20496.383     0.999121        50237      1137.78
   20496.383     0.999219        50237      1280.00
   20512.767     0.999316        50255      1462.86
   20512.767     0.999414        50255      1706.67
   20512.767     0.999512        50255      2048.00
   20512.767     0.999561        50255      2275.56
   20512.767     0.999609        50255      2560.00
   20529.151     0.999658        50266      2925.71
   20529.151     0.999707        50266      3413.33
   20529.151     0.999756        50266      4096.00
   20529.151     0.999780        50266      4551.11
   20529.151     0.999805        50266      5120.00
   20529.151     0.999829        50266      5851.43
   20545.535     0.999854        50271      6826.67
   20545.535     0.999878        50271      8192.00
   20545.535     0.999890        50271      9102.22
   20545.535     0.999902        50271     10240.00
   20545.535     0.999915        50271     11702.86
   20545.535     0.999927        50271     13653.33
   20545.535     0.999939        50271     16384.00
   20561.919     0.999945        50273     18204.44
   20561.919     0.999951        50273     20480.00
   20561.919     0.999957        50273     23405.71
   20561.919     0.999963        50273     27306.67
   20561.919     0.999969        50273     32768.00
   20561.919     0.999973        50273     36408.89
   20561.919     0.999976        50273     40960.00
   20561.919     0.999979        50273     46811.43
   20578.303     0.999982        50274     54613.33
   20578.303     1.000000        50274          inf
#[Mean    =    13626.445, StdDeviation   =     3934.672]
#[Max     =    20561.920, Total count    =        50274]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  75968 requests in 29.99s, 10.99MB read
Requests/sec:   2532.88
Transfer/sec:    375.20KB